Revit 2027 API
NumberingSchema.FilterToNumberableCategories Method
 Filters a set of categorie IDs to only does that are usable in numbering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> FilterToNumberableCategories(
	ISet<ElementId> categories,
	Document document
)
Public Shared Function FilterToNumberableCategories (
	categories As ISet(Of ElementId),
	document As Document
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ FilterToNumberableCategories(
	ISet<ElementId^>^ categories,
	Document^ document
)
static member FilterToNumberableCategories :
        categories : ISet<ElementId> *
        document : Document -> ISet<ElementId>
Parameters
categories ISet<ElementId>
 The categories to filter.
document Document
 The document where the categories are located.
Return Value
ISet<ElementId>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace